###############################################################################
# Created by write_sdc
# Wed Apr 24 18:39:09 2024
###############################################################################
current_design user_proj_IMPACT_HEAD
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Byte_Mode_Enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Byte_Select[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Byte_Select[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_In_Enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {PreCharge}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Proj_Select[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Proj_Select[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ReadEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Reram_In_Enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Trunc_Enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WL_enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WriteEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io1}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io2}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io3}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Data_Out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io1}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io2}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_io3}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {user_irq[2]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {analog_io1}]
set_load -pin_load 0.0334 [get_ports {analog_io2}]
set_load -pin_load 0.0334 [get_ports {analog_io3}]
set_load -pin_load 0.0334 [get_ports {Data_Out[7]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[6]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[5]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[4]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[3]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[2]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[1]}]
set_load -pin_load 0.0334 [get_ports {Data_Out[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[0]}]
set_load -pin_load 0.0334 [get_ports {io_out[5]}]
set_load -pin_load 0.0334 [get_ports {io_out[4]}]
set_load -pin_load 0.0334 [get_ports {io_out[3]}]
set_load -pin_load 0.0334 [get_ports {io_out[2]}]
set_load -pin_load 0.0334 [get_ports {io_out[1]}]
set_load -pin_load 0.0334 [get_ports {io_out[0]}]
set_load -pin_load 0.0334 [get_ports {user_irq[2]}]
set_load -pin_load 0.0334 [get_ports {user_irq[1]}]
set_load -pin_load 0.0334 [get_ports {user_irq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Byte_Mode_Enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In_Enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {PreCharge}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ReadEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Reram_In_Enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Trunc_Enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WL_enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WriteEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_io3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Byte_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Byte_Select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Proj_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Proj_Select[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
